#!/bin/bash
#字符颜色显示
#-e:允许echo使用转义
#\033[:开始位
#\033[0m:结束位
#\033等同于\e
echo "字体颜色"
echo -e "\033[30m黑色字\033[0m"  
echo -e "\033[31m红色字\033[0m"  
echo -e "\033[32m绿色字\033[0m"  
echo -e "\033[33m黄色字\033[0m"  
echo -e "\033[34m蓝色字\033[0m"  
echo -e "\033[35m紫色字\033[0m"  
echo -e "\033[36m天蓝字\033[0m"  
echo -e "\033[37m白色字\033[0m" 
echo “背景颜色”
#背景颜色范围:40-47  
echo -e "\033[40m黑底白字\033[0m"  
echo -e "\033[41m红底白字\033[0m"  
echo -e "\033[42m绿底白字\033[0m"  
echo -e "\033[43m黄底白字\033[0m"  
echo -e "\033[44m蓝底白字\033[0m"  
echo -e "\033[45m紫底白字\033[0m"  
echo -e "\033[46m天蓝底白字\033[0m"  
echo -e "\033[47m白底白字\033[0m" 
##字符颜色与背景颜色用;号相隔
echo "字符颜色与背景颜色用"
echo -e "\033[40;37m黑底白字\033[0m"  
echo -e "\033[41;30m红底黑字\033[0m"  
echo -e "\033[42;34m绿底蓝字\033[0m"  
echo -e "\033[43;34m黄底蓝字\033[0m"  
echo -e "\033[44;30m蓝底黑字\033[0m"  
echo -e "\033[45;30m紫底黑字\033[0m"  
echo -e "\033[46;30m天蓝底黑字\033[0m"  
echo -e "\033[47;34m白底蓝字\033[0m" 
#0:关闭特殊效果
#1:高亮显示
#4:下划线
#5:闪烁
#7:反白显示
#8:隐藏不可见
#特殊效果和颜色用;号相隔,没有顺序
echo "闪烁颜色"
echo -e "\033[0;46;30m天蓝底黑字\033[0m"  
echo -e "\033[1;46;30m天蓝底黑字\033[0m"  
echo -e "\033[4;46;30m天蓝底黑字\033[0m"  
echo -e "\033[5;46;30m天蓝底黑字\033[0m"  
echo -e "\033[7;46;30m天蓝底黑字\033[0m"  
echo -e "\033[8;46;30m天蓝底黑字\033[0m"
